{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.3.0", "signature": {"inputs": {"dense_105_input:0": {"name": "dense_105_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "55"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_35/dense_105/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "55"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_105/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_106/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_106/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "dense_105_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "55"}]}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_105/Relu", "op": "_FusedMatMul", "input": ["dense_105_input", "StatefulPartitionedCall/sequential_35/dense_105/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_35/dense_105/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_106/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_35/dense_105/Relu", "StatefulPartitionedCall/sequential_35/dense_106/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_35/dense_106/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_35/dense_106/Relu", "StatefulPartitionedCall/sequential_35/dense_107/MatMul/ReadVariableOp", "StatefulPartitionedCall/sequential_35/dense_107/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_35/dense_107/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_35/dense_107/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 561}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_35/dense_105/MatMul/ReadVariableOp", "shape": [55, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_35/dense_105/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_35/dense_106/MatMul/ReadVariableOp", "shape": [10, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_35/dense_106/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/MatMul/ReadVariableOp", "shape": [10, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_35/dense_107/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}